#Задача №112212. Чётные цифры
print(len([i for i in list(input()) if int(i)%2 == 0]))