#Задача №3829. Четные элементы
print(' '.join([x for x in input().split() if int(x) % 2 == 0]))