#Задача №3835. Наименьший положительный
print(min([int(x) for x in input().split() if int(x) > 0]))